import { Factory } from "miragejs";

export default Factory.extend({
  name: (i: number) =>
    [
      "کلاس طراحي شي گراي سيستم ها-۰۱",
      "کلاس اقتصاد مهندسي-۰۱",
      "کلاس مهندسي اينترنت-۰۱",
      "کلاس آزمايشگاه شبكه هاي كامپيوتري-۰۶",
      "کلاس اصول طراحی کامپایلر",
      "کلاس طراحی سیستم‌های دیجیتال",
      "کلاس روش پژوهش و ارائه",
      "کلاس ریزپردازنده",
      "کلاس آیین زندگی",
      "کلاس آزمایشگاه پایگاه داده",
    ][i % 10],
  // afterCreate(classroom: any, server: any) {
  //   server.createList("user", 5, { classroom });
  // },
});
